[
    {
        "_id": "123",
        "topic": "Space",
        "userName": "SpaceX",
        "title": "Tesla Cybertruck lands on Mars and picks up the Curiosity rover on its 6' bed",
        "time": "2h",
        "image": "spacex.jpeg",
        "liked": true,
        "disliked": false,
        "replies": 123,
        "retuits": 432,
        "likes": 2345,
        "dislikes": 10,
        "handle": "@spacex",
        "tuit": "The Space Coast is getting ready for another SpaceX launch happening Friday before noon. The Falcon 9 rocket launch is set for 11:33 a.m. Friday from Space Launch Complex 40 at Cape Canaveral Space Force Station. The rocket will launch 56 Starlink satellites into low-Earth orbit. The first stage of the rocket will land on a drone ship out in the Atlantic Ocean. The forecast for the launch Friday is near-perfect, with a less than 5% chance that weather will prevent the launch."
    },
    {
        "_id": "345",
        "topic": "Energy",
        "userName": "Tesla",
        "title": "Tesla FSD finally makes driving obsolete. After years of delay, Tesla Full Self Driving can drive you to work while you work, play, or sleep",
        "time": "4d",
        "image": "tesla.jpg",
        "liked": false,
        "disliked": true,
        "replies": 234,
        "retuits": 543,
        "likes": 3456,
        "dislikes": 20,
        "handle": "@tesla",
        "tuit": "Autopilot is an advanced driver assistance system that enhances safety and convenience behind the wheel. When used properly, Autopilot reduces your overall workload as a driver. Each new Tesla vehicle is equipped with eight external cameras and powerful vision processing to provide an additional layer of safety. Model 3 and Model Y built for the European and Middle Eastern markets will now utilise our camera-based Tesla Vision, which are not equipped with radar and instead rely on Tesla’s advanced suite of cameras and neural net processing to deliver Autopilot and related features."
    },
    {
        "_id": "234",
        "topic": "Space",
        "userName": "SpaceX",
        "title": "100s of SpaceX Starships land on Mars after a 6 month journey. 1000s of Martian colonists being building Mars Base 1",
        "time": "2h",
        "image": "spacex.jpeg",
        "liked": true,
        "disliked": false,
        "replies": 345,
        "retuits": 321,
        "likes": 1234,
        "dislikes": 30,
        "handle": "@spacex",
        "tuit": "You want to wake up in the morning and think the future is going to be great - and that’s what being a spacefaring civilization is all about. It’s about believing in the future and thinking that the future will be better than the past. And I can’t think of anything more exciting than going out there and being among the stars"
    }
]
